The  MEPConnectorInfo  type exposes the following members.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  MEPConnectorInfo
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
IsPrimary
 True if this is the primary connector.
IsSecondary
 True if this is the secondary connector.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkedConnector
 The linked connector or    a null reference (  Nothing  in Visual Basic)  if there is no linked connector
 See Also
  MEPConnectorInfo Class
  Autodesk.Revit.DB Namespace